wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief Swich DMA/DMM Phase Setting Register
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @return     PHDMAW/PHDMAR/PHDMM Register Address
 */
static void *SPIM_SwitchPhaseRegister(SPIM_T *spim, uint32_t u32OPMode)
{
    switch (u32OPMode)
    {
        case SPIM_CTL0_OPMODE_PAGEWRITE:
            return (uint32_t *)&spim->PHDMAW;
            break;

        case SPIM_CTL0_OPMODE_PAGEREAD:
            return (uint32_t *)&spim->PHDMAR;
            break;

        case SPIM_CTL0_OPMODE_DIRECTMAP:
            return (uint32_t *)&spim->PHDMM;
            break;

        default:
            break;
    }

    return NULL;
}

/**
 * @brief Clear DMAW/DMAR/DMM Phase Config
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
int32_t SPIM_DMAM_ClearPhaseConfig(SPIM_T *spim, uint32_t u32OPMode)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    *pu32PhaseReg &= ~(0xFFFFFFFF);    /* clear phase setting. */

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Command Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 */
int32_t SPIM_DMAM_SetCmdPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    *pu32PhaseReg &= ~(0xFF);  /* clear Command phase setting. */

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAW_DW_CMD_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_CMD_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_CMD_Pos);

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Address Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
int32_t SPIM_DMAM_SetAddrPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    *pu32PhaseReg &= ~(0xFF << 8); /* clear Address phase setting. */

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAW_DW_ADDR_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_ADDR_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_ADDR_Pos);

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Continue Read Mode Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
int32_t SPIM_DMAM_SetContReadPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

