wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    *pu32PhaseReg &= ~(0xFF << 16);    /* clear Read Mode phase setting. */

    *pu32PhaseReg |= (u32Width << SPIM_PHDMAR_DW_MODE_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAR_BM_MODE_Pos);
    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_MODE_Pos);

    return SPIM_OK;
}

/**
 * @brief Set DMA/DMM Data Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32ByteOrder Set Received Data Byte Order of Received Data Phase for Octal SPI Flash
 *                  - \ref PHASE_ORDER_MODE0 : Reveice Data Format Ref. {byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7}
 *                  - \ref PHASE_ORDER_MODE1 : Reveice Data Format Ref. {byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0}
 *                  - \ref PHASE_ORDER_MODE2 : Reveice Data Format Ref. {byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6}
 *                  - \ref PHASE_ORDER_MODE3 : Reveice Data Format Ref. {byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1}
 * @param u32RdDQS Set Enable/Disable Read DQS Mode Enable Bit for Data Phase 0 or 1
 * @param u32DTREn Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
int32_t SPIM_DMAM_SetDataPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32ByteOrder, uint32_t u32RdDQS, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    *pu32PhaseReg &= ~(0xFF << 24);     /* clear Data phase setting. */

    *pu32PhaseReg |= (u32DTREn << SPIM_PHDMAR_DTR_DATA_Pos);
    *pu32PhaseReg |= (u32RdDQS << SPIM_PHDMAR_RDQS_DATA_Pos);
    *pu32PhaseReg |= (u32ByteOrder << SPIM_PHDMAW_PBO_DATA_Pos);
    *pu32PhaseReg |= (u32NBit << SPIM_PHDMAW_BM_DATA_Pos);

    return SPIM_OK;
}

/**
 * @brief Init DMA/DMM SPI Flash Read/Wirte Command Phase
 * @param spim
 * @param pPhaseTable   Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32OPMode     SPI Function Operation Mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                      - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 */
void SPIM_InitDMAMCommandPhase(SPIM_T *spim,
                               FLASH_CMD_PHASE_T *pPhaseTable,
                               uint32_t u32OPMode)
{
    uint32_t u32RDQSOn = 0;

    SPIM_CLEAR_MODE_DATA(spim);
    SPIM_DMM_DISABLE_CREN(spim);

    /* Set Flash Command Phase */
    SPIM_DMAM_SetCmdPhase(spim,
                          u32OPMode,
                          pPhaseTable->u32CMDPhase,
                          pPhaseTable->u32CMDWidth,
                          pPhaseTable->u32CMDDTR);

    /* Set Flash Address Phase */
    SPIM_DMAM_SetAddrPhase(spim,
                           u32OPMode,
                           pPhaseTable->u32AddrPhase,
                           pPhaseTable->u32AddrWidth,
                           pPhaseTable->u32AddrDTR);

    /* Set DMA/DMM Continue Read Phase */
    SPIM_DMAM_SetContReadPhase(spim,
                               u32OPMode,
                               pPhaseTable->u32RdModePhase,
                               pPhaseTable->u32RdModeWidth,
                               pPhaseTable->u32RdModeDTR);

    if (pPhaseTable->u32RdModeOn == PHASE_READMODE_ON)
    {
        if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
        {
            SPIM_DMM_ENABLE_CREN(spim);
        }

        /* Enable Contiue Read Mode */
        SPIM_SET_MODE_DATA(spim, CMD_CONTINUE_READ_MODE);
    }

    if (pPhaseTable->u32DataPhase == PHASE_OCTAL_MODE)
    {
        u32RDQSOn = 1;
    }

    /* Set Flash Data Phase */
    SPIM_DMAM_SetDataPhase(spim,
                           u32OPMode,
                           pPhaseTable->u32DataPhase,
                           pPhaseTable->u32ByteOrder,
                           u32RDQSOn,
                           pPhaseTable->u32DataDTR);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DC_DMAR(spim, pPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DC_DMM(spim, pPhaseTable->u32DcNum);
    }
}

/**
 * @brief Search SPI Flash Command and init DMA/DMM SPI flash read/wirte command phase
 *
 * @param spim
 * @param pPhaseTable   Check SPI Flash specifications for support command codes,
 *                      and create command phase table.
 * @param u32TableSize  Phase Talbe total size
 * @param u32OPMode     SPI Function Operation Mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                      - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                      - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32CMDCode
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_FAIL    SPIM operation Fail.
 */
int32_t SPIM_FindAndInitDMAMCmdPhase(SPIM_T *spim,
                                     FLASH_CMD_PHASE_T *pPhaseTable,
                                     uint32_t u32TableSize,
                                     uint32_t u32OPMode,
                                     uint32_t u32CMDCode)
{
    uint32_t u32i = 1;
    int32_t i32found = SPIM_ERR_FAIL;
    uint32_t u32TableIdx = 0;
    FLASH_CMD_PHASE_T *pTmpTable = NULL;

