wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    for (u32i = 0; u32i < u32TableSize; u32i++)
    {
        /*
         * If element is found in array then raise found flag
         * and terminate from loop.
         */
        if (pPhaseTable[u32i].u32CMDCode == u32CMDCode)
        {
            i32found = SPIM_OK;
            u32TableIdx = u32i;
            break;
        }
    }

    if (i32found != SPIM_OK)
    {
        return SPIM_ERR_FAIL;
    }

    pTmpTable = (FLASH_CMD_PHASE_T *)&pPhaseTable[u32TableIdx];

    SPIM_InitDMAMCommandPhase(spim, pTmpTable, u32OPMode);

    return SPIM_OK;
}

/**
 * @brief Calculate I/O phase bit mode size.
 *
 * @param u32Phase
 *          - \ref PHASE_NORMAL_MODE : 1 Bit Mode
 *          - \ref PHASE_DUAL_MODE   : 2 Bit Mode
 *          - \ref PHASE_QUAD_MODE   : 4 Bit Mode
 *          - \ref PHASE_OCTAL_MODE  : 8 Bit Mode
 * @return uint32_t Phase Size
 */
uint32_t SPIM_GetIOPhaseSize(uint32_t u32Phase)
{
    switch (u32Phase)
    {
        case PHASE_DUAL_MODE:
            return 2;

        case PHASE_QUAD_MODE:
            return 4;

        case PHASE_OCTAL_MODE:
            return 8;

        default:
        case PHASE_NORMAL_MODE:
            return 1;
    }

    return 1;
}

void SPIM_IO_DataPhase(SPIM_T *spim, uint8_t u8TRxBuf[], uint32_t u32TRxSize,
                       uint32_t u32DataPhase, uint32_t u32DTREn, uint32_t isSync)
{
    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */
    //SPIM_SET_RDQS_MODE(spim, u32DTREn);

    if (isSync == 1)
    {
        SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_write(spim, u8TRxBuf, u32TRxSize);                /* Write out data.  */
    }
    else
    {
        SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_read(spim, u8TRxBuf, u32TRxSize);   /* Read back data.  */
    }

    SPIM_SET_SS_EN(spim, 0);    /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
    SPIM_SET_RDQS_MODE(spim, 0);

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32DataPhase);
    }
}

void SPIM_IO_DCPhase(SPIM_T *spim,
                     uint32_t u32NDummy,
                     uint32_t u32DcPhase,
                     uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[32] =
    {
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA
    };

    if (u32NDummy == 0)
    {
        return;
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */

    SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DcPhase));

    /* Same bit mode as above. */
    spim_write(spim, u8CmdBuf, u32NDummy);  /* Write out dummy bytes. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_AddrPhase(SPIM_T *spim,
                       uint32_t u32Is4ByteAddr,
                       uint32_t u32Addr,
                       uint32_t u32AddrPhase,
                       uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[8] = {0};
    uint8_t u8BufIdx = 0;

    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;

    }
    else
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }

    if (((SPIM_GetIOPhaseSize(u32AddrPhase) == 2) ||
            (SPIM_GetIOPhaseSize(u32AddrPhase) == 4)))
    {
        u8BufIdx++;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32AddrPhase));
    spim_write(spim, u8CmdBuf, u8BufIdx);  /* Write out u32Address. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_CMDPhase(SPIM_T *spim, uint32_t u32RdCMD, uint32_t u32CMDPhase,
                      uint32_t u32DTREn, uint32_t isSync)
{
    uint8_t u8CmdBuf[2] = {0};
    uint8_t u8CmdSize = 1UL;

    SPIM_SET_DTR_MODE(spim, u32DTREn); /* DTR Activated. */

    if (isSync == 1)
    {
        SPIM_Set_Write_Enable(spim, 1, SPIM_GetIOPhaseSize(u32CMDPhase));        /* Write Enable.    */
    }

    SPIM_SET_SS_EN(spim, 1);    /* CS activated. */

    u8CmdBuf[0] = (u32RdCMD & 0xFF);

    if (u32DTREn == 1)
    {
        u8CmdBuf[1] = 0x00;
        u8CmdSize = 2UL;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32CMDPhase));
    spim_write(spim, u8CmdBuf, u8CmdSize);    /* Write out command. */

    //SPIM_SET_SS_EN(spim, 0);    /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

/**
  * @brief      Write data in the same page by I/O mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      isSync      Block or not.
  * @return     None.
  */
static void SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr,
                                     int is4ByteAddr, uint32_t u32NTx,
                                     uint8_t pu8TxBuf[], uint8_t wrCmd,
                                     uint32_t u32NBitCmd, uint32_t u32NBitAddr,
                                     uint32_t u32NBitDat, int isSync)
{
    uint8_t   cmdBuf[16];
    uint32_t  buf_idx;

    SPIM_Set_Write_Enable(spim, 1, u32NBitCmd);         /* Write Enable. */

    SPIM_SET_SS_EN(spim, 1);                            /* CS activated. */

    SwitchNBitOutput(spim, u32NBitCmd);
    cmdBuf[0] = wrCmd;
    spim_write(spim, cmdBuf, 1UL);                      /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

