wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                  /* Write out u32Address. */

    SwitchNBitOutput(spim, u32NBitDat);
    spim_write(spim, pu8TxBuf, u32NTx);                 /* Write out data.  */

    SPIM_SET_SS_EN(spim, 0);                            /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBitCmd);
    }

    if (u32NBitCmd == 4UL)
    {
        SPIM_SET_DTR_MODE(spim, 0);
    }
}

/**
  * @brief      Write data in the same page by Page Write mode.
  * @param      u32Addr     Start u32Address to write.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @param      isSync      Block or not.
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
static int SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr,
                                           int is4ByteAddr, uint32_t u32NTx,
                                           uint8_t pu8TxBuf[], uint32_t wrCmd,
                                           int isSync)
{
    SPIM_Set_Write_Enable(spim, 1, 1);                  /* Write Enable. */

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);          /* Enable/disable 4-Byte Address. */

    SPIM_SET_SPIM_MODE(spim, wrCmd);                    /* SPIM mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to Page Write mode. */

    spim->SRAMADDR = (uint32_t)pu8TxBuf;                /* SRAM u32Address. */
    spim->DMACNT = u32NTx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address.*/

    if (SPIM_WaitSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_Wait_Write_Done(spim, 1);

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Write data to SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr: Start u32Address to write.
  * @param      is4ByteAddr: 4-byte u32Address or not.
  * @param      u32NTx: Number of bytes to write.
  * @param      pu8TxBuf: Transmit buffer.
  * @param      wrCmd: Write command.
  * @param      u32NBitCmd: N-bit transmit command.
  * @param      u32NBitAddr: N-bit transmit u32Address.
  * @param      u32NBitDat: N-bit transmit/receive data.
  * @return     None.
  */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                   uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t wrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    uint32_t  pageOffset, toWr;
    uint32_t  buf_idx = 0UL;

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)          /* Do all the bytes fit onto one page ? */
    {
        SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, u32NTx, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                 wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
        u32Addr += toWr;                         /* Advance indicator.  */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByIo(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx],
                                     wrCmd, u32NBitCmd, u32NBitAddr, u32NBitDat, 1);
            u32Addr += toWr;                 /* Advance indicator.  */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by sending commands manually (I/O mode).
  * @param      u32Addr     Start u32Address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      rdCmd       Read command.
  * @param      u32NBitCmd  N-bit transmit command.
  * @param      u32NBitAddr N-bit transmit u32Address.
  * @param      u32NBitDat  N-bit transmit/receive data.
  * @param      u32NDummy   Number of dummy bytes following address.
  * @return     None.
  */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                  uint32_t u32NRx, uint8_t pu8RxBuf[], uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat,
                  int u32NDummy, uint32_t u32DTREn)
{
    uint8_t cmdBuf[16] = {0};
    uint32_t buf_idx;

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated. */

    cmdBuf[0] = rdCmd;
    SwitchNBitOutput(spim, u32NBitCmd);
    spim_write(spim, cmdBuf, 1UL);                /* Write out command. */

    buf_idx = 0UL;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t) u32Addr;
    }

    //while (u32NDummy--)
    {
        //buf_idx += u32NDummy;   /* Write out dummy bytes. */
        cmdBuf[buf_idx++] = 0x00U;  /* Write out dummy bytes. */
    }

    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                 /* Write out u32Address. */

    //buf_idx = 0UL;

    /* Same bit mode as above. */
    //spim_write(spim, cmdBuf, buf_idx);  /* Write out dummy bytes. */

    SwitchNBitInput(spim, u32NBitDat);
    spim_read(spim, pu8RxBuf, u32NRx);  /* Read back data. */

    SPIM_SET_SS_EN(spim, 0);    /* CS deactivated. */
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                    uint32_t u32NTx, uint8_t pu8TxBuf[], uint32_t wrCmd)
{
    uint32_t   pageOffset, toWr;
    uint32_t   buf_idx = 0UL;

    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAW_CMD_DTR(spim) == 1))
    {
        wrCmd = ((wrCmd << 8) | wrCmd);
    }

