wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    SPIM_ENABLE_DLL0_OLDO(spim, 1);

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    SPIM_ENABLE_DLL0_OVRST(spim, 1);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_WAIT_DLL0_CLKON(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLLOCK to 0x1,
       and the value 0x1 indicates that DLL circuit is in lock state */
    while (SPIM_WAIT_DLL0_LOCK(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
       and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_WAIT_DLL0_READY(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    /* Set this valid delay number to control register DLL_DNUM. */
    SPIM_SET_DLL0_DELAY_NUM(spim, u32DelayNum);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_WAIT_DLL0_REFRESH(spim) != 0)
    {
        if (i32Timeout-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

//------------------------------------------------------------------------------
// SPIM Hyper Define Function Prototypes
//------------------------------------------------------------------------------
/**
 * @brief   Set Hyper Bus Mode
 *
 * @param spim
 * @param u32Div Hyper bus device the setting values of DIVIDER are only 1 and 2.
 * @return int
 */
void SPIM_Hyper_Open(SPIM_T *spim, uint32_t u32Div)
{
    SPIM_SET_OP_MODE(spim, SPIM_OP_HYPER_MODE); /* Enable SPIM Hyper Bus Mode */

    /* Check if clock divider is 1 or 2 */
    if (u32Div <= 0)
    {
        u32Div = 1;
    }
    else if (u32Div > 2)
    {
        u32Div = 2;
    }

    SPIM_SET_CLOCK_DIVIDER(spim, u32Div);
}

/**
 * @brief    Restore SPI Flash Mode
 *
 * @param spim
 * @return int
 */
void SPIM_Hyper_Close(SPIM_T *spim)
{
    SPIM_SET_OP_MODE(spim, SPIM_OP_FLASH_MODE); /* Enable SPIM SPI Flash Mode */

}

/**
 * @brief Wait Hyper Bus interface is Idle
 *
 * @param spim
 * @return     SPIM_OK          SPIM operation OK.
 *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
 * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
 */
int32_t SPIM_Hyper_IsIdle(SPIM_T *spim)
{
    volatile int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Reset hyper chip function
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       if waiting Hyper Chip time-out.
  */
int32_t SPIM_Hyper_Reset(SPIM_T *spim)
{
    spim->HYPER_CMD = SPIM_HYPER_CMD_RESET;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Exit from Hybrid sleep and deep Power down function
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_HyperRAM_ExitHSAndDPD(SPIM_T *spim)
{
    spim->HYPER_CMD = SPIM_HYPER_CMD_EXIT_HS_PD;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read hyper chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_FAIL    SPIM operation Fail.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_HyperRAM_ReadReg(SPIM_T *spim, uint32_t u32Addr)
{
    if ((u32Addr != HYPER_RAM_ID_REG0) &&
            (u32Addr != HYPER_RAM_ID_REG1) &&
            (u32Addr != HYPER_RAM_CONFIG_REG0) &&
            (u32Addr != HYPER_RAM_CONFIG_REG1))
    {
        return SPIM_ERR_FAIL;
    }

    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_HRAM_REGISTER;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Write Hyper Chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @param[in]
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_FAIL    SPIM operation Fail.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_HyperRAM_WriteReg(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Value)
{
    if ((u32Addr != HYPER_RAM_ID_REG0) &&
            (u32Addr != HYPER_RAM_ID_REG1) &
            (u32Addr != HYPER_RAM_CONFIG_REG0) &&
            (u32Addr != HYPER_RAM_CONFIG_REG1))
    {
        return SPIM_ERR_FAIL;
    }

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Value;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_REGISTER;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read 1 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 16 bit data of hyper chip space.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int16_t SPIM_Hyper_Read1Word(SPIM_T *spim, uint32_t u32Addr)
{
    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_1_WORD;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Read 2 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 32bit data of hyper chip space.
  */
int32_t SPIM_Hyper_Read2Word(SPIM_T *spim, uint32_t u32Addr)
{
    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_2_WORD;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return (spim->HYPER_RDATA & 0xFFFFFFFF);
}

/**
  * @brief      Write 1 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u8Data   8 bits data to be written to hyper chip space
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_Hyper_Write1Byte(SPIM_T *spim, uint32_t u32Addr, uint8_t u8Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u8Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_1_BYTE;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 2 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u16Data  16 bits data to be written to Hyper Chip space
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_Hyper_Write2Byte(SPIM_T *spim, uint32_t u32Addr, uint16_t u16Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u16Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_2_BYTE;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 3 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u32Data  24 bits data to be written to Hyper Chip space
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_Hyper_Write3Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_3_BYTE;

    if (SPIM_Hyper_IsIdle(spim) != SPIM_OK)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 4 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u32Data  32 bits data to be written to hyper chip space
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int32_t SPIM_Hyper_Write4Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

